In [1]:
import pandas as pd

In [13]:
df = pd.DataFrame([[1,2,3],
              [4,5,6],
              [7,8,9]],
            columns=["col01","col02","col03"],
            index=["idx0","idx1","idx2"])
df

      col01  col02  col03
idx0      1      2      3
idx1      4      5      6
idx2      7      8      9

In [8]:
import numpy as np

In [14]:
df = pd.DataFrame(np.array(
             [[1,2,3],
              [4,5,6],
              [7,8,9]]),
            columns=["col01","col02","col03"],
            index=["idx0","idx1","idx2"])
df

      col01  col02  col03
idx0      1      2      3
idx1      4      5      6
idx2      7      8      9

In [15]:
df.index

Index(['idx0', 'idx1', 'idx2'], dtype='object')

In [17]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [20]:
df = pd.DataFrame({"col1":[1,2,3],
                   "col2":[4,5,6],
                   "col3":[7,8,9]})
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [23]:
df.index=["idx01","idx02","idx03"]
df

       col1  col2  col3
idx01     1     4     7
idx02     2     5     8
idx03     3     6     9

In [25]:
df = pd.DataFrame({"col1":[1,2,3],
                   "col2":[4,5,6],
                   "col3":[7,8,9]},
                 index=["idx01","idx02","idx03"])
df

       col1  col2  col3
idx01     1     4     7
idx02     2     5     8
idx03     3     6     9

In [29]:
df = pd.DataFrame([[1,2,3],
                   [4,5,6],
                   [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [33]:
df.index=["idx1","idx2","idx3"]
df.columns=["col1","col2","col3"]
df

      col1  col2  col3
idx1     1     2     3
idx2     4     5     6
idx3     7     8     9

In [49]:
df.columns=["col4","col5","col6"]
df

      col4  col5  col6
idx1     1     2     3
idx2     4     5     6
idx3     7     8     9

In [50]:
df = df.rename(columns={"col4":"x"})
df

      x  col5  col6
idx1  1     2     3
idx2  4     5     6
idx3  7     8     9

In [52]:
df = df.rename(index={"idx3":"hehe","idx2":"your"})
df

      x  col5  col6
idx1  1     2     3
your  4     5     6
hehe  7     8     9

In [61]:
df["x"]

idx1    1
your    4
hehe    7
Name: x, dtype: int64

In [58]:
type(df["x"])

pandas.core.series.Series

In [59]:
df[["x"]]

      x
idx1  1
your  4
hehe  7

In [63]:
type(df[["x"]])

pandas.core.frame.DataFrame

In [69]:
df.loc["hehe"]  #loc が rows　,何も書かずに["~"]の形が columns 取得

x       7
col5    8
col6    9
Name: hehe, dtype: int64

In [78]:
df.loc["idx1","col6"]

3

In [79]:
df.loc[:,"col5"] # ":" は「全て」という意味

idx1    2
your    5
hehe    8
Name: col5, dtype: int64

In [80]:
df["col5"]

idx1    2
your    5
hehe    8
Name: col5, dtype: int64

In [81]:
df.iloc[:,0] #ilocでは index番号を扱う

idx1    1
your    4
hehe    7
Name: x, dtype: int64

In [82]:
df = pd.DataFrame([[1,2,3],
              [4,5,6],
              [7,8,9]],
            columns=["col01","col02","col03"],
            index=["idx0","idx1","idx2"])
df

      col01  col02  col03
idx0      1      2      3
idx1      4      5      6
idx2      7      8      9

In [ ]:
#45:05から